Documents/Запрос.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Document>
		<Properties>
			<Name>Запрос</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПараметрыЗапроса</xr:Item>
				<xr:Item>InformationRegister.ПараметрыЗапросаЛинейный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АгентствоНедвижимости</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БезОтделки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Блок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСделки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидСделки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозрастнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВозрастнаяГруппа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаПравообладателей</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПравообладателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмеющиесяНаличныеСредства</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникПриходаКлиента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиПриходаКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоКомнат_1</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоКомнат_2</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоКомнат_3</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоКомнат_4</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоСекций_Несколько</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоСекций_Одна</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеПервыйЭтаж</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеПоследнийЭтаж</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъемСредствНаПокупку</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оптовый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отделка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервоначальныйОбъект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлощадьДо</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлощадьОт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проживает</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Расположение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расстояние</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасшифровкаИсточниковПриходаКлиента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РасшифровкаИсточниковПриходаКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасшифровкаСтатуса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныСтатусовЗапроса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоставСемьи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СоставСемьи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокСдачи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СрокиСдачиОбъектовСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стадия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтадииЗапроса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗапроса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДомаМонолит</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДомаПанель</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОбъектаНедвижимости</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбъектовНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УточнениеРасшифровкиИсточникаПрихода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УточнениеРасшифровкиИсточниковПриходаКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтажДо</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтажОт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ФакторыВыбораОН</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФакторВыбора</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФакторыВыбораОН</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Конкуренты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Конкурент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Конкуренты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СтопФакторы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтопФактор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФакторыВыбораОН</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Участники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Клиент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основной</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОсновнойТелефон</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Брокер</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВИП</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокОбъектовСтроительства</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектСтроительства</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыСтроительства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Корпус</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КорпусаОбъектовСтроительства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Фазы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Фаза</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Фазы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФормыОплаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФормаОплаты</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ФормыОплаты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Расположения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Расположение</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Расположение</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Мотивации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Мотивация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Мотивации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЦелиПокупки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЦельПокупки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЦельПокупки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Запрос/Forms/ПараметрыПечатиЗаявкиНаЭкскурсию/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Дата = ТекущаяДата();
	ЗначениеВДанныеФормы(Параметры.ЗапросСсылка.ПолучитьОбъект(), Объект);
	ЗначениеВДанныеФормы(ПолучитьИзВременногоХранилища(Параметры.ЛистингАдрес), Листинг);
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры, , "ЗакрыватьПриВыборе, ЗакрыватьПриЗакрытииВладельца, КлючНазначенияИспользования, ТолькоПросмотр");	
		
	//Если _Листинг.Количество() Тогда
	//	Для каждого Строка Из _Листинг Цикл
	//		Строка.Блок = ПолучитьБлок(Строка.ОбъектНедвижимости, Строка.ОбъектСтроительства);	
	//	КонецЦикла;
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Печатать(Команда)
	
	Закрыть();
	ПечатьЗаявкиНаЭкскурсиюНаСервере(ТД, ?(Дата = Неопределено, Объект.Дата, Дата));
	ТД.Напечатать(РежимИспользованияДиалогаПечати.Использовать);
	
КонецПроцедуры

&НаСервере 
Процедура ЗаполнитьПараметрыПоОбъекту(ОбластьМакета) 

	//ОбластьМакета.Параметры.Дата = Объект.Дата;
	//ОбластьМакета.Параметры.МенеджерПоПродажам = Объект.Ответственный;
	//ОбластьМакета.Параметры.ФИО = Объект.Клиент.ФИО;
	//ОбластьМакета.Параметры.Телефон = Объект.Клиент.ОсновнойТелефон;
	
	//ОбластьМакета.Параметры.Объект = Объект.Проект;
	ОбластьМакета.Параметры.Фаза = Фазы;
		
	ОбластьМакета.Параметры.Однокомнтаные = ?(Объект.КоличествоКомнат_1, "☑", "☐");
	ОбластьМакета.Параметры.Двухкомнатные = ?(Объект.КоличествоКомнат_2, "☑", "☐");
	ОбластьМакета.Параметры.Трехкомнатные = ?(Объект.КоличествоКомнат_3, "☑", "☐");
	ОбластьМакета.Параметры.Четырехкомнатные = ?(Объект.КоличествоКомнат_4, "☑", "☐");

	ОбластьМакета.Параметры.Блок = ?(Объект.Блок, "☑", "☐");	
	ОбластьМакета.Параметры.Корпус = Корпуса;
	
	ОбластьМакета.Параметры.Монолит = ?(Объект.ТипДомаМонолит, "☑", "☐");;
	ОбластьМакета.Параметры.Панель = ?(Объект.ТипДомаПанель, "☑", "☐");
	
	ОбластьМакета.Параметры.СоставСемьи = Объект.СоставСемьи;
	ОбластьМакета.Параметры.ФакторыВыбора = ФакторыВыбора;
	ОбластьМакета.Параметры.СтопФакторы = СтопФакторы;
	ОбластьМакета.Параметры.ЦельПокупки = ЦельПокупки;
	
КонецПроцедуры

&НаСервере
Процедура ПечатьЗаявкиНаЭкскурсиюНаСервере(ТД, ДатаЭкскурсии)
	
	ТД.Очистить();
	
	ТД.АвтоМасштаб = Истина;
	ТД.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТД.ПолеСверху = 10;
	ТД.ПолеСнизу = 10;
	ТД.ПолеСлева = 8;
	ТД.ПолеСправа = 8;	
 	ТД.ЭкземпляровНаСтранице = 1;
	
	МакетЗаявкиНаЭкскурсию = Документы.Запрос.ПолучитьМакет("МакетЗаявкиНаЭкскурсию");
	
	ОбластьМакета = МакетЗаявкиНаЭкскурсию.ПолучитьОбласть("Шапка"); 
	КартинкаПроекта = ПолучитьКартинкуПроекта(Объект.Проект);
	ОбластьМакета.Рисунки.Логотип.Картинка = ?(ЗначениеЗаполнено(КартинкаПроекта), КартинкаПроекта, Новый Картинка);
	ТД.Вывести(ОбластьМакета);
	
	ОбластьМакета = МакетЗаявкиНаЭкскурсию.ПолучитьОбласть("ИнформацияПоОтветственному"); 
	ОбластьМакета.Параметры.Дата = ДатаЭкскурсии;//Объект.Дата;
	ОбластьМакета.Параметры.МенеджерПоПродажам = Объект.Ответственный;
	ОбластьМакета.Параметры.ФИО = Объект.Клиент.ФИО;
	ОбластьМакета.Параметры.Телефон = Объект.Клиент.ОсновнойТелефон;	
	ОбластьМакета.Параметры.ВидКлиента = Элементы.ВидКлиента.СписокВыбора[ВидКлиента].Представление;	
	ТД.Вывести(ОбластьМакета);
	
	ОбластьМакета = МакетЗаявкиНаЭкскурсию.ПолучитьОбласть("ЗаполнениеПараметров");	
	ЗаполнитьПараметрыПоОбъекту(ОбластьМакета);	
	ТД.Вывести(ОбластьМакета);	
	
	ОбластьМакета = МакетЗаявкиНаЭкскурсию.ПолучитьОбласть("ЛистингШапка");
	МассивОбластейДляПроверки = Новый Массив;
	МассивОбластейДляПроверки.Добавить(ОбластьМакета);				
	Если НЕ ТД.ПроверитьВывод(МассивОбластейДляПроверки) Тогда
		ТД.ВывестиГоризонтальныйРазделительСтраниц();
		ОбластьМакета = МакетЗаявкиНаЭкскурсию.ПолучитьОбласть("Шапка");
		ТД.Вывести(ОбластьМакета);
		ОбластьМакета = МакетЗаявкиНаЭкскурсию.ПолучитьОбласть("ЛистингШапка");
		ТД.Вывести(ОбластьМакета);
	Иначе
		ТД.Вывести(ОбластьМакета);
	КонецЕсли;
			
	Для каждого Строка Из Листинг Цикл	
		ОбластьСтрока = МакетЗаявкиНаЭкскурсию.ПолучитьОбласть("ЛистингСтрока");
		МассивОбластейДляПроверки = Новый Массив;
		МассивОбластейДляПроверки.Добавить(ОбластьМакета);				
		Если НЕ ТД.ПроверитьВывод(МассивОбластейДляПроверки) Тогда
			ТД.ВывестиГоризонтальныйРазделительСтраниц();
			ОбластьМакета = МакетЗаявкиНаЭкскурсию.ПолучитьОбласть("Шапка");
			ТД.Вывести(ОбластьМакета);
			ОбластьМакета = МакетЗаявкиНаЭкскурсию.ПолучитьОбласть("ЛистингСтрока");
			ТД.Вывести(ОбластьМакета);
		КонецЕсли;
		ОбластьСтрока.Параметры.ОбъектКорпус = "" + Строка(Строка.Проект) + "/" + Строка(Строка.ОбъектСтроительства);
		ОбластьСтрока.Параметры.Этаж = Строка(Строка.Этаж);
		ОбластьСтрока.Параметры.Комнаты = Строка(Строка.КоличествоКомнат);
		ОбластьСтрока.Параметры.Статус = Строка(Строка.Статус);
		ОбластьСтрока.Параметры.ВидМатериала = Строка(Строка.ВидМатериала);
		ОбластьСтрока.Параметры.ТипОтделки = ?(ЗначениеЗаполнено(Строка(Строка.ТипОтделки.СокращённоеНаименование)), Строка(Строка.ТипОтделки.СокращённоеНаименование), Строка(Строка.ТипОтделки));
		ОбластьСтрока.Параметры.Блок = Строка.Блок;		
		ОбластьСтрока.Параметры.НомерКвартиры = Строка(Строка.ОбъектНедвижимости);
		ОбластьСтрока.Параметры.СтроительныйНомер = Строка.СтроительныйНомер;
		ОбластьСтрока.Параметры.ПлощадьПроектная = Строка.ПлощадьПроектная;
		ОбластьСтрока.Параметры.Площадь = ?(ЗначениеЗаполнено(Строка.СтроительныйНомер), Строка.Площадь, 0);		
		ОбластьСтрока.Параметры.КомментарийЭкскурсовода = "";//Объект.Комментарий;		
		ТД.Вывести(ОбластьСтрока);
	КонецЦикла;
	
	//ОбластьМакета = МакетЗаявкиНаЭкскурсию.ПолучитьОбласть("ПропускСтроки");
	//ТД.Вывести(ОбластьМакета);	
	//
	//ОбластьМакета = МакетЗаявкиНаЭкскурсию.ПолучитьОбласть("ПодписьЭкскурсовода");
	//ТД.Вывести(ОбластьМакета);
	
	ПропускСтроки = МакетЗаявкиНаЭкскурсию.ПолучитьОбласть("ПропускСтроки");
	ТД.Вывести(ПропускСтроки);	
	
	ПодписьЭкскурсовода = МакетЗаявкиНаЭкскурсию.ПолучитьОбласть("ПодписьЭкскурсовода");
	ТД.Вывести(ПодписьЭкскурсовода);
		
	МассивОбластейДляПроверки = Новый Массив;
	МассивОбластейДляПроверки.Добавить(ПропускСтроки);
	МассивОбластейДляПроверки.Добавить(ПодписьЭкскурсовода);
	
	Пока ТД.ПроверитьВывод(МассивОбластейДляПроверки) Цикл
		ТД.Вывести(ПропускСтроки);
	КонецЦикла;
	
	МассивОбластейДляПроверки.Добавить(ПодписьЭкскурсовода);
	
	//ОбластьМакета = МакетЗаявкиНаЭкскурсию.ПолучитьОбласть("Подвал");
	//ТД.Вывести(ОбластьМакета);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКартинкуПроекта(Проект)
	
	Попытка 
		Возврат Новый Картинка(Проект.Плашка.Получить());
	Исключение
	КонецПопытки;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьБлок(ОН, ОС)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Квартирограмма.Блок КАК Блок
	|ИЗ
	|	РегистрСведений.Квартирограмма КАК Квартирограмма
	|ГДЕ
	|	Квартирограмма.ОбъектНедвижимости = &ОбъектНедвижимости
	|	И Квартирограмма.ОбъектСтроительства = &ОбъектСтроительства";
	
	Запрос.УстановитьПараметр("ОбъектНедвижимости", ОН);
	Запрос.УстановитьПараметр("ОбъектСтроительства", ОС);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Блок;
	КонецЕсли;
	
КонецФункции
